Ran Plan for dir: `external/iac/homelab/vpc` workspace: `default`

<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 4.35.0"...
- Installing hashicorp/aws v4.62.0...
- Installed hashicorp/aws v4.62.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
aws_vpc.this[0]: Refreshing state... [id=vpc-03b003e069e39ab31]
aws_route_table.private[1]: Refreshing state... [id=rtb-0c0334cd4c95c4f38]
aws_route_table.private[2]: Refreshing state... [id=rtb-00f77ea1a8b6bc191]
aws_route_table.private[0]: Refreshing state... [id=rtb-037a36ba68ccf84a9]
aws_subnet.public[1]: Refreshing state... [id=subnet-068316acdc117b048]
aws_route_table.public[0]: Refreshing state... [id=rtb-09a2650452d4b7de8]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0856ccccadb268b18]
aws_subnet.public[2]: Refreshing state... [id=subnet-079d0a432e9dcb6f9]
aws_subnet.database[1]: Refreshing state... [id=subnet-0d09c1ea71406b028]
aws_subnet.public[0]: Refreshing state... [id=subnet-06c80c419d2e5f19b]
aws_subnet.database[2]: Refreshing state... [id=subnet-016b409087881150e]
aws_subnet.database[0]: Refreshing state... [id=subnet-081185881a0e196e9]
aws_subnet.private[1]: Refreshing state... [id=subnet-07cb2c3e671a4eaa8]
aws_subnet.private[2]: Refreshing state... [id=subnet-0a0f18ea9c2153524]
aws_subnet.private[0]: Refreshing state... [id=subnet-0cf371b175fffb06e]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-09a2650452d4b7de81080289494]
aws_db_subnet_group.database[0]: Refreshing state... [id=homelab-vpc]
aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0ee40232edc1e949b]
aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0ba08b289278ebc5f]
aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0f36993c0e3c2b42c]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0bbbdd398852c6dcd]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-038724e8dc7cc00ab]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0283d4b35caadb3c5]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0290c9e097660d709]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-080df8c74595c3e76]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0ae65b12b07aa2570]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = "acl-0990fe678dc5dcb93"
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Environment" = "homelab"
          + "Name"        = "homelab-vpc-default"
          + "Owner"       = "linhng98"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "homelab"
          + "Name"        = "homelab-vpc-default"
          + "Owner"       = "linhng98"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = "rtb-0d7d1d787fb7efb46"
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Environment" = "homelab"
          + "Name"        = "homelab-vpc-default"
          + "Owner"       = "linhng98"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "homelab"
          + "Name"        = "homelab-vpc-default"
          + "Owner"       = "linhng98"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "homelab"
          + "Name"        = "homelab-vpc-default"
          + "Owner"       = "linhng98"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "homelab"
          + "Name"        = "homelab-vpc-default"
          + "Owner"       = "linhng98"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-03b003e069e39ab31"
    }

  # aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-06c80c419d2e5f19b"
      ~ map_public_ip_on_launch                        = true -> false
        tags                                           = {
            "Environment" = "homelab"
            "Name"        = "homelab-vpc-public-ap-southeast-1a"
            "Owner"       = "linhng98"
            "Terraform"   = "true"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-068316acdc117b048"
      ~ map_public_ip_on_launch                        = true -> false
        tags                                           = {
            "Environment" = "homelab"
            "Name"        = "homelab-vpc-public-ap-southeast-1b"
            "Owner"       = "linhng98"
            "Terraform"   = "true"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-079d0a432e9dcb6f9"
      ~ map_public_ip_on_launch                        = true -> false
        tags                                           = {
            "Environment" = "homelab"
            "Name"        = "homelab-vpc-public-ap-southeast-1c"
            "Owner"       = "linhng98"
            "Terraform"   = "true"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
      ~ enable_dns_hostnames                 = false -> true
        id                                   = "vpc-03b003e069e39ab31"
        tags                                 = {
            "Environment" = "homelab"
            "Name"        = "homelab-vpc"
            "Owner"       = "linhng98"
            "Terraform"   = "true"
        }
        # (16 unchanged attributes hidden)
    }

Plan: 3 to add, 4 to change, 0 to destroy.

Changes to Outputs:
  ~ database_subnets_cidr_blocks         = [
      - "10.0.240.0/24",
      - "10.0.241.0/24",
      - "10.0.242.0/24",
    ] -> [
      + "10.0.240.0/24",
      + "10.0.241.0/24",
      + "10.0.242.0/24",
    ]
  ~ database_subnets_ipv6_cidr_blocks    = [
      - "",
      - "",
      - "",
    ] -> []
  ~ elasticache_subnets_cidr_blocks      = [] -> []
  ~ elasticache_subnets_ipv6_cidr_blocks = [] -> []
  ~ intra_subnets_cidr_blocks            = [] -> []
  ~ intra_subnets_ipv6_cidr_blocks       = [] -> []
  ~ outpost_subnets_cidr_blocks          = [] -> []
  ~ outpost_subnets_ipv6_cidr_blocks     = [] -> []
  ~ private_subnets_cidr_blocks          = [
      - "10.0.0.0/20",
      - "10.0.16.0/20",
      - "10.0.32.0/20",
    ] -> [
      + "10.0.0.0/20",
      + "10.0.16.0/20",
      + "10.0.32.0/20",
    ]
  ~ private_subnets_ipv6_cidr_blocks     = [
      - "",
      - "",
      - "",
    ] -> []
  ~ public_subnets_cidr_blocks           = [
      - "10.0.48.0/20",
      - "10.0.64.0/20",
      - "10.0.80.0/20",
    ] -> [
      + "10.0.48.0/20",
      + "10.0.64.0/20",
      + "10.0.80.0/20",
    ]
  ~ public_subnets_ipv6_cidr_blocks      = [
      - "",
      - "",
      - "",
    ] -> []
  ~ redshift_subnets_cidr_blocks         = [] -> []
  ~ redshift_subnets_ipv6_cidr_blocks    = [] -> []
  ~ vpc_enable_dns_hostnames             = false -> true
  ~ vpc_secondary_cidr_blocks            = [] -> []

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /atlantis-data/repos/linhng98/mess-around/68/default/external/iac/homelab/vpc/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/atlantis-data/repos/linhng98/mess-around/68/default/external/iac/homelab/vpc/default.tfplan"
Releasing state lock. This may take a few moments...
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d external/iac/homelab/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.homelab.linhng98.com/lock?id=linhng98%252Fmess-around%252Fexternal%252Fiac%252Fhomelab%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d external/iac/homelab/vpc`
</details>
Plan: 3 to add, 4 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`